frontend/views/article/list_game.php

 * @var $dataProvider
 */
use common\models\Category;
$games_category = Category::find()->where(['parent_id' => 1])->asArray()->all();
---
SELECT * FROM `category` WHERE `parent_id`=1