frontend/controllers/ArticleController.php

    public function behaviors()
    {
        return [
            [
                'class' =>VerbFilter::className(),
                'actions' => [
                    'comment'  => ['POST'],
                ]
            ],
            [
                'class' => HttpCache::className(),
                'only' => ['view'],
                'lastModified' => function ($action, $params) {
                    $id = Yii::$app->getRequest()->get('id');
                    $model = Article::findOne(['id' => $id, 'type' => Article::ARTICLE, 'status' => Article::ARTICLE_PUBLISHED]);
                    if( $model === null ) throw new NotFoundHttpException(Yii::t("frontend", "Article id {id} is not exists", ['id' => $id]));
                    Article::updateAllCounters(['scan_count' => 1], ['id' => $id]);
---
SELECT * FROM `article` WHERE (`id`='29') AND (`type`=0) AND (`status`=1)
UPDATE `article` SET `scan_count`=`scan_count`+1 WHERE `id`='29'

    public function actionIndex($cat = '')
    {
        if ($cat == '') {
            $cat = Yii::$app->getRequest()->getPathInfo();
        }
        $where = ['type' => Article::ARTICLE, 'status' => Article::ARTICLE_PUBLISHED];
        $descendants = '';
        if ($cat != '' && $cat != 'index') {
            if ($cat == Yii::t('app', 'UnClassified')) {
                $where['cid'] = 0;
            } else {
                if (! $category = Category::findOne(['alias' => $cat])) {
---
SELECT * FROM `category` WHERE `alias`='games'

        // recommendArticles 、 news
        $recommendArticles = $news = [];
        if (in_array($cat, ['index', '', 'news'])) {
            $recommendArticles = Article::find()->select(['id', 'title', 'thumb', 'game_icon'])->where(['flag_recommend' => 1])->asArray()->all();
            $news = Article::find()->select(['id', 'title', 'updated_at'])->where(['cid' => 3])->asArray()->all();
---
SELECT `id`, `title`, `thumb`, `game_icon` FROM `article` WHERE `flag_recommend`=1
SELECT `id`, `title`, `updated_at` FROM `article` WHERE `cid`=3

    public function actionView($id)
    {
        /** @var ArticleServiceInterface $articleService */
        $articleService = Yii::$app->get(ArticleServiceInterface::ServiceName);
        $model = $articleService->getArticleById($id);
        /** @var Article $model */
        if( $model === null ) throw new NotFoundHttpException(Yii::t("frontend", "Article id {id} is not exists", ['id' => $id]));
        $prev = Article::find()
            ->where(['cid' => $model->cid, 'type' => Article::ARTICLE, 'status' => Article::ARTICLE_PUBLISHED])
            ->andWhere(['>', 'id', $id])
            ->orderBy("sort asc,id asc")
            ->limit(1)
            ->one();
        $next = Article::find()
            ->where(['cid' => $model->cid, 'type' => Article::ARTICLE, 'status' => Article::ARTICLE_PUBLISHED])
            ->andWhere(['<', 'id', $id])
            ->orderBy("sort asc,id desc")
            ->limit(1)
            ->one();//->createCommand()->getRawSql();
        $commentModel = new Comment();
        $commentList = $commentModel->getCommentByAid($id);
        $recommends = Article::find()
            ->where(['type' => Article::ARTICLE, 'status' => Article::ARTICLE_PUBLISHED])
            ->andWhere(['<>', 'thumb', ''])
            ->orderBy("scan_count")
            ->limit(8)
            ->with('category')
            ->all();
---
SELECT * FROM `article` WHERE ((`cid`=3) AND (`type`=0) AND (`status`=1)) AND (`id` > '29') ORDER BY `sort`, `id` LIMIT 1
SELECT * FROM `article` WHERE ((`cid`=3) AND (`type`=0) AND (`status`=1)) AND (`id` < '29') ORDER BY `sort`, `id` DESC LIMIT 1
SELECT * FROM `article` WHERE ((`type`=0) AND (`status`=1)) AND (`thumb` <> '') ORDER BY `scan_count` LIMIT 8