common/models/Category.php

    protected static function _getCategories()
    {
        return self::find()->orderBy(['sort'=>SORT_ASC, "parent_id"=>SORT_ASC])->all();
---
SELECT * FROM `category` ORDER BY `sort`, `parent_id`