backend/components/AdminLog.php

    public static function update($event)
    {
        if (! empty($event->changedAttributes)) {
            $desc = '<br>';
            $oldAttributes = $event->sender->oldAttributes;
            foreach ($event->changedAttributes as $name => $value) {
                if( $oldAttributes[$name] == $value ) continue;
                !is_string( $value ) && $value = print_r($value, true);
                $desc .= $event->sender->getAttributeLabel($name) . '(' . $name . ') : ' . $value . '=>' . $event->sender->oldAttributes[$name] . ',<br>';
            }
            $desc = substr($desc, 0, -5);
            $model = new AdminLogModel();
            $class = $event->sender->className();
            $idDes = '';
            if (isset($event->sender->id)) {
                $idDes = '{{%ID%}} ' . $event->sender->id;
            }
            $model->description = '{{%ADMIN_USER%}} [ ' . Yii::$app->getUser()->getIdentity()->username . ' ] {{%BY%}} ' . $class . ' [ ' . $class::tableName() . ' ] ' . " {{%UPDATED%}} {$idDes} {{%RECORD%}}: " . $desc;
            $model->route = Yii::$app->controller->id . '/' . Yii::$app->controller->action->id;
            $model->user_id = Yii::$app->getUser()->id;
            $model->save();
---
INSERT INTO `admin_log` (`description`, `route`, `user_id`, `created_at`) VALUES ('{{%ADMIN_USER%}} [ admin ] {{%BY%}} common\\models\\Category [ {{%category}} ]  {{%UPDATED%}} {{%ID%}} 1 {{%RECORD%}}: <br>分类模板(template) : =>/article/list_game.php,<br>文章模板(article_template) : =>/article/article_game.php,<br>最后更新(updated_at) : 1621500943=>1621502688', 'category/update', 1, 1621502688)